tutorials/incompressible/pUCoupledFoam/backwardFacingStepLaminar/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (1.5 0 0)
    (8 0 0)
    (0 -0.5 0)
    (1.5 -0.5 0)
    (8 -0.5 0)
    (1.5 -1 0)
    (8 -1 0)
    (0 0 0.025)
    (1.5 0 0.025)
    (8 0 0.025)
    (0 -0.5 0.025)
    (1.5 -0.5 0.025)
    (8 -0.5 0.025)
    (1.5 -1 0.025)
    (8 -1 0.025)
);

blocks
(
    hex (3 4 1 0 11 12 9 8) (40 20 1) simpleGrading (0.5 1 1)
    hex (4 5 2 1 12 13 10 9) (100 20 1) simpleGrading (10 1 1)
    hex (6 7 5 4 14 15 13 12) (100 20 1) simpleGrading (10 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (3 0 8 11)
    )
    patch outlet
    (
        (2 5 13 10)
        (5 7 15 13)

    )
    wall upperWall
    (
        (0 1 9 8)
        (1 2 10 9)
    )
    wall lowerWall
    (
        (3 4 12 11)
        (4 6 14 12)
        (6 7 15 14)
    )
    empty frontAndBack
    (
        (0 1 4 3)
        (1 2 5 4)
        (4 5 7 6)
        (8 11 12 9)
        (9 12 13 10)
        (12 14 15 13)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
